[
  {
    "id": "p1",
    "type": "house",
    "price": 950000,
    "bedrooms": 4,
    "dateAdded": "2026-11-10",
    "postcodeArea": "CMB",
    "title": "Modern 4-bed House in Colombo",
    "shortDescription": "Spacious modern house in Colombo.",
    "longDescription": "This modern 4-bedroom house offers spacious, air-conditioned bedrooms with stylish interiors, comfortable bedding, and private bathrooms designed for a relaxing stay. Guests can enjoy open-plan living areas, a fully equipped kitchen, free Wi-Fi, secure private parking, a lush garden, and a private swimming pool ideal for family or group stays. The property features contemporary architecture, poolside seating, modern bathrooms, balconies with garden views, and bright natural lighting throughout the home. Conveniently located in Colombo, the house provides easy access to main roads, shopping areas, restaurants, and key city attractions, and is highly rated by guests for its cleanliness, modern facilities, peaceful environment, and excellent accessibility.",
    "location": "Colombo, Sri Lanka",
    "mainImage": "/images/p1/1.jpg",
    "images": ["/images/p1/1.jpg","/images/p1/2.jpg","/images/p1/3.jpg","/images/p1/4.jpg","/images/p1/5.jpg","/images/p1/6.jpg"],
    "floorPlan": "/images/p1/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Colombo%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p2",
    "type": "flat",
    "price": 420000,
    "bedrooms": 2,
    "dateAdded": "2026-12-01",
    "postcodeArea": "KDY",
    "title": "2-bed Flat in Kandy",
    "shortDescription": "Bright flat with balcony and lift access.",
    "longDescription": "This modern 2-bedroom flat in Kandy offers bright, well-ventilated rooms with comfortable bedding, large windows, and a clean, contemporary interior suitable for everyday living. The property includes a modern kitchen, spacious living area, private balcony, secure building entry, and dedicated parking, providing both comfort and convenience. Located in Kandy, the flat offers easy access to the city center, public transport, shopping areas, schools, and essential services, and is highly valued for its secure environment, modern layout, scenic surroundings, and suitability as a first home or investment.",
    "location": "Kandy, Sri Lanka",
    "mainImage": "/images/p2/1.jpg",
    "images": ["/images/p2/1.jpg","/images/p2/2.jpg","/images/p2/3.jpg","/images/p2/4.jpg","/images/p2/5.jpg","/images/p2/6.jpg"],
    "floorPlan": "/images/p2/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Kandy%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p3",
    "type": "house",
    "price": 650000,
    "bedrooms": 3,
    "dateAdded": "2026-11-25",
    "postcodeArea": "GLL",
    "title": "3-bed House in Galle",
    "shortDescription": "Townhouse with terrace and storage.",
    "longDescription": "This modern 3-bedroom townhouse in Galle offers spacious, well-lit bedrooms with comfortable bedding, modern finishes, and a clean, relaxing interior suitable for family living. The property features multiple living levels, modern bathrooms, a functional kitchen, secure entry, and well-maintained indoor spaces designed for everyday comfort. Situated in Galle, the townhouse provides convenient access to main roads, schools, shopping areas, and essential services while remaining in a quiet residential neighborhood, and is highly regarded for its family-friendly layout, modern design, and peaceful environment, making it ideal for long-term living.",
    "location": "Galle, Sri Lanka",
    "mainImage": "/images/p3/1.jpg",
    "images": ["/images/p3/1.jpg","/images/p3/2.jpg","/images/p3/3.jpg","/images/p3/4.jpg","/images/p3/5.jpg","/images/p3/6.jpg"],
    "floorPlan": "/images/p3/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Galle%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p4",
    "type": "flat",
    "price": 310000,
    "bedrooms": 1,
    "dateAdded": "2026-12-15",
    "postcodeArea": "NEG",
    "title": "1-bed Studio in Negombo",
    "shortDescription": "Compact studio near city amenities.",
    "longDescription": "This well-designed 1-bedroom home in Negombo offers a cozy bedroom, bright living space, and modern interiors ideal for single occupants or couples. The property features a functional kitchen, comfortable living and dining areas, a private garden space, and well-maintained bathroom facilities for everyday convenience. Located in Negombo, the home provides easy access to main roads, public transport, beaches, shopping areas, and essential services, and is highly appreciated for its excellent location, easy commute, and suitability as a perfect starter home.",
    "location": "Negombo, Sri Lanka",
    "mainImage": "/images/p4/1.jpg",
    "images": ["/images/p4/1.jpg","/images/p4/2.jpg","/images/p4/3.jpg","/images/p4/4.jpg","/images/p4/5.jpg","/images/p4/6.jpg"],
    "floorPlan": "/images/p4/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Negombo%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p5",
    "type": "house",
    "price": 1200000,
    "bedrooms": 5,
    "dateAdded": "2026-10-30",
    "postcodeArea": "NUW",
    "title": "Luxury 5-bed Villa in Nuwara Eliya",
    "shortDescription": "Premium finish, large garden and garage.",
    "longDescription": "This high-end family home offers spacious, elegantly designed bedrooms with large windows, quality furnishings, and a bright, airy atmosphere ideal for comfortable living. The property features open-plan living and dining areas, a fully equipped modern kitchen, a private swimming pool, landscaped garden, and ample indoor and outdoor relaxation spaces. Situated in a desirable residential area, the home provides convenient access to top schools, essential services, and main road connections while maintaining privacy and tranquility, and is highly regarded for its premium design, family-friendly layout, and excellent location, making it an ideal long-term family residence.",
    "location": "Nuwara Eliya, Sri Lanka",
    "mainImage": "/images/p5/1.jpg",
    "images": ["/images/p5/1.jpg","/images/p5/2.jpg","/images/p5/3.jpg","/images/p5/4.jpg","/images/p5/5.jpg","/images/p5/6.jpg","/images/p5/7.jpg"],
    "floorPlan": "/images/p5/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Nuwara%20Eliya%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p6",
    "type": "flat",
    "price": 560000,
    "bedrooms": 3,
    "dateAdded": "2026-12-20",
    "postcodeArea": "BTM",
    "title": "3-bed Flat in Battaramulla",
    "shortDescription": "River-side apartment with concierge.",
    "longDescription": "This spacious 3-bedroom home in Battaramulla features large, well-furnished bedrooms with comfortable bedding, modern lighting, and a warm, inviting interior. The property offers generous living and dining areas, modern bathrooms, quality furnishings, landscaped outdoor spaces, and well-maintained facilities throughout the home. Located in Battaramulla, the property provides excellent connectivity to Colombo, government offices, schools, shopping centers, and main road networks, and is highly appreciated for its spacious rooms, peaceful surroundings, and excellent facilities, making it ideal for family living.",
    "location": "Battaramulla, Sri Lanka",
    "mainImage": "/images/p6/1.jpg",
    "images": ["/images/p6/1.jpg","/images/p6/2.jpg","/images/p6/3.jpg","/images/p6/4.jpg","/images/p6/5.jpg","/images/p6/6.jpg"],
    "floorPlan": "/images/p6/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Battaramulla%20Sri%20Lanka&output=embed"
  },
  {
    "id": "p7",
    "type": "house",
    "price": 480000,
    "bedrooms": 2,
    "dateAdded": "2026-11-05",
    "postcodeArea": "JFN",
    "title": "2-bed House in Jaffna",
    "shortDescription": "Cozy home with modern kitchen.",
    "longDescription": "This charming 2-bedroom home in Jaffna offers well-lit, comfortable bedrooms with natural ventilation, cozy interiors, and a relaxed atmosphere ideal for couples or small families. The property includes a functional kitchen, comfortable living spaces, private bathrooms, a garden area, and well-maintained indoor and outdoor areas for everyday convenience. Located in a quiet residential area of Jaffna, the home provides easy access to main roads, local shops, schools, and essential services, and is highly appreciated for its peaceful surroundings, easy accessibility, and suitability for small families and couples.",
    "location": "Jaffna, Sri Lanka",
    "mainImage": "/images/p7/1.jpg",
    "images": ["/images/p7/1.jpg","/images/p7/2.jpg","/images/p7/3.jpg","/images/p7/4.jpg","/images/p7/5.jpg","/images/p7/6.jpg"],
    "floorPlan": "/images/p7/floorplan.jpg",
    "mapEmbedUrl": "https://maps.google.com/maps?q=Jaffna%20Sri%20Lanka&output=embed"
  }
]
